package com.nolookblog.common.em;

/**
 * @author Mrrrrr10
 * @description 响应枚举, 前三位: 服务标识; 后三位: 异常标识
 */

public enum ResponseEnum {

	//////////////////////////////////// 通用编码 ////////////////////////////////////

	C_SUCCESS(200, "success"),
	C_REDIRECT(301, "资源重定向"),
	C_UNAUTHORIZED(401, "未进行身份认证"),
	C_FORBIDDEN(403, "没权限访问"),
	C_NOT_FOUND(404, "资源未找到"),
	C_SERVER_ERROR(500, "系统繁忙, 请稍后再试"),

	//////////////////////////////////// 公用异常编码(100) ////////////////////////////////////
	E_100101(100101, ""),
	E_100102(100102, "传入参数为空"),
	E_100103(100103, "没权限访问"),
	E_100104(100104, "请求失败"),
	E_100105(100105, "密码为空"),

	E_100108(100108, "用户未登录"),
	E_100109(100109, "登录过期"),
	E_100110(100110, "登录状态无效"),
	E_100111(100111, "token认证失败"),

	E_100112(100112, "上传错误"),
	E_100113(100113, "数据记录不存在"),
	E_100115(100115, "请勿重复提交数据"),
	E_100116(100116, "token不能为空"),
	E_100117(100117, "(E_100117)重复请求或者token已过期"),
	E_100118(100118, "(E_100118)重复请求或者token已过期"),
	E_100119(100119, "(E_100119)重复请求或者token已过期"),
	E_999999(999999, "未知错误"),

	//////////////////////////////////// 用户异常编码(200) ////////////////////////////////////
	E_200101(200101, ""),
	E_200102(200102, "账号为空"),
	E_200103(200103, "账号不存在或者密码错误"),
	E_200104(200104, "账号已被冻结"),
	E_200105(200105, "账号已被禁用"),
	E_200106(200106, "账号未登录"),
	E_200107(200107, "账号不存在"),
	E_200108(200108, "用户未登录或者登录状态已过期"),

	//////////////////////////////////// 产品异常编码(300) ////////////////////////////////////
	E_300101(300101, ""),
	E_300102(300102, "访问的产品不存在"),
	E_300103(300103, "没权限访问该平台"),

	//////////////////////////////////// 安全异常编码(400) ////////////////////////////////////
	E_400101(400101, ""),
	E_400102(400102, "校验失败, sessionId不能为空"),
	E_400103(400103, "认证失败, 请重新登录进行认证"),
	E_400104(400104, "认证超时, ticket失效或者已使用"),
	E_400105(400105, "(E_400105)操作失败, 请联系管理员"),
	E_400106(400106, "校验失败, ticket不能为空"),
	E_400107(400107, "操作失败, 没有可用的会话"),
	E_400108(400108, "(E_400108)操作失败, 请联系管理员"),

	;

	/**
	 * 响应状态码
	 */
	private Integer code;

	/**
	 * 响应信息
	 */
	private String message;

	ResponseEnum(Integer code, String msg) {
		this.code = code;
		this.message = msg;
	}

	public Integer getCode() {
		return code;
	}

	public void setCode(Integer code) {
		this.code = code;
	}

	public String getMessage() {
		return message;
	}

	public void setMessage(String message) {
		this.message = message;
	}
}
